---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetServiceId(System.Int32)
source: html/dc16382e-84f3-a3f0-c302-abc334133d2e.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetServiceId Method

Set the fabrication service identifier to change the elements to.

## Syntax (C#)
```csharp
public void SetServiceId(
	int serviceId
)
```

## Parameters
- **serviceId** (`System.Int32`)